function model = CreateModel(count)
    %مختصات تغریبی مرکز استان های تهران
    %x = [35.70 35.84 36.27 36.68 34.08 38.24 37.55 32.64 31.31 33.63 37.47 27.19 28.91 32.88 38.07 33.45 37.27 29.48 36.56 35.57 35.31 32.34 29.58 34.63 30.33 34.32 36.84 36.29 34.79 30.66 31.90];
    %y = [51.34 50.97 50.00 48.50 49.70 48.29 45.07 51.67 48.66 46.41 57.32 56.28 50.82 59.21 46.28 48.33 49.59 60.86 53.05 53.39 46.99 50.86 52.58 50.87 57.10 47.07 57.42 59.60 48.51 51.60 54.35];
   
    x = randi(100, 1, count);
    y = randi(100, 1, count);
    n = numel(x);
    
    D = zeros(n, n);
    
    for i = 1 : n-1
        for j = i+1 : n
            
            D(i,j) = sqrt((x(i)-x(j))^2 + (y(i)-y(j))^2);
            D(j,i) = D(i,j);
        end
    end
    
    model.cityCount = n;
    model.x = x;
    model.y = y;
    model.distances = D;
end
